### Terraform Plan 📋 - QA

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_public_ip.example[0] will be created
  + resource "azurerm_public_ip" "example" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "qa-adam-example-pip-0"
      + resource_group_name     = "example-resources-qa"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_public_ip.example[1] will be created
  + resource "azurerm_public_ip" "example" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "qa-adam-example-pip-1"
      + resource_group_name     = "example-resources-qa"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_public_ip.example[2] will be created
  + resource "azurerm_public_ip" "example" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "qa-adam-example-pip-2"
      + resource_group_name     = "example-resources-qa"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_public_ip.example[3] will be created
  + resource "azurerm_public_ip" "example" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "qa-adam-example-pip-3"
      + resource_group_name     = "example-resources-qa"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_public_ip.example[4] will be created
  + resource "azurerm_public_ip" "example" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "westeurope"
      + name                    = "qa-adam-example-pip-4"
      + resource_group_name     = "example-resources-qa"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
    }

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "example-resources-qa"
    }

  # azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space                  = [
          + "10.0.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "westeurope"
      + name                           = "example-vnet"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "example-resources-qa"
      + subnet                         = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```

</details>

**Plan Status:** success
**Environment:** QA
**Workflow:** [#9](https://github.com/m0ntl/TF-presentation/actions/runs/20695009463)
